In [4]:
import pandas as pd 
import pandas_profiling
import os 

def get_data_frame():
    df = pd.DataFrame()
    for filename in os.listdir('../data'):
        temp_df = pd.read_csv(f'../data/{filename}')
        df = pd.concat([df, temp_df], axis=0)
    return df

df = get_data_frame()
df.columns = ['DATE', 'LOCATION', 'CUSTOMER NAME', 'PRODUCTS', 'PAYMENT METHOD', 'TOTAL', 'CARD']
df.reset_index()
print(df.shape)
print(df.sample(5))

(539, 7)
                    DATE       LOCATION   CUSTOMER NAME  \
188  2021-02-23 12:09:19  Isle of Wight       Rex Klein
509  2021-02-23 17:30:44  Isle of Wight  Gloria Members
355  2021-02-23 14:56:04  Isle of Wight    Ethel Brisco
118  2021-02-23 10:59:24  Isle of Wight   Melvin Thomas
123  2021-02-23 11:04:21  Isle of Wight       Mary Soto

                                              PRODUCTS PAYMENT METHOD  TOTAL  \
188        Large,Flavoured hot chocolate - Caramel,2.9           CARD   2.90
509  ,Hot Chocolate,1.4,,Flavoured iced latte - Haz...           CASH   5.45
355                        ,Speciality Tea - Green,1.3           CASH   1.30
118  ,Speciality Tea - Darjeeling,1.3,,Frappes - St...           CASH   5.85
123  ,Speciality Tea - Green,1.3,,Speciality Tea - ...           CASH   5.45

                          CARD
188  discover,6011362792873448
509                       None
355                       None
118                       None
123                       None

In [5]:
df.sample()

,DATE,LOCATION,CUSTOMER NAME,PRODUCTS,PAYMENT METHOD,TOTAL,CARD
57,2021-02-23 09:58:00,Isle of Wight,Daniel Branch,"Large,Flavoured hot chocolate - Hazelnut,2.9,L...",CARD,9.25,"visa16,4235514362176413"

In [6]:
# profile = df.profile_report(title="Pandas Profiling Report")

# profile.to_file(output_file="my_profiling_report.html

In [9]:
new_card_info = df['CARD'].str.split(',', expand=True)
new_card_info

                   0                 1
0           discover  6011776257398866
1           discover  6011893765428836
2               None              None
3               None              None
4    americanexpress   347932748275944
..               ...               ...
534             None              None
535             None              None
536             None              None
537             None              None
538             None              None

[539 rows x 2 columns]

In [15]:
df.drop(columns=['CARD'])

,DATE,LOCATION,CUSTOMER NAME,PRODUCTS,PAYMENT METHOD,TOTAL
0,2021-02-23 09:01:45,Isle of Wight,William Perdomo,"Large,Latte,2.45",CARD,2.45
1,2021-02-23 09:02:27,Isle of Wight,Amber Roberts,",Frappes - Coffee,2.75,,Cortado,2.05,,Glass of...",CARD,8.10
2,2021-02-23 09:03:02,Isle of Wight,Tisha Timmons,",Speciality Tea - Camomile,1.3,,Hot Chocolate,1.4",CASH,2.70
3,2021-02-23 09:04:40,Isle of Wight,Johnnie Davis,",Flavoured iced latte - Hazelnut,2.75,Large,Es...",CASH,7.25
4,2021-02-23 09:05:18,Isle of Wight,Jason Martin,"Regular,Filter coffee,1.5,Large,Flavoured hot ...",CARD,7.25
...,...,...,...,...,...,...
534,2021-02-23 17:55:39,Isle of Wight,Audrey Hansen,",Iced americano,2.15,,Glass of milk,0.7,,Mocha...",CASH,7.15
535,2021-02-23 17:56:04,Isle of Wight,Natasha Yates,"Large,Chai latte,2.6,Large,Flavoured latte - C...",CASH,8.35
536,2021-02-23 17:57:28,Isle of Wight,Harriette Blackman,"Regular,Hot chocolate,2.2",CASH,2.20
537,2021-02-23 17:58:17,Isle of Wight,Ramon Salters,"Regular,Americano,1.95,,Flat white,2.15,,Flavo...",CASH,6.85
538,2021-02-23 17:59:04,Isle of Wight,Stanley Cordano,",Frappes - Coffee,2.75,,Speciality Tea - Darje...",CASH,8.50

In [ ]:
df.concat